import pandas as pd

"""
ohlc_data = [
    [dt.date(2020, 4, 1), dt.time(1), 107.556, 117.921, 97.546, 107.789],
    [dt.date(2020, 4, 1), dt.time(2), 107.788, 117.944, 97.672, 107.708],
    [dt.date(2020, 4, 1), dt.time(3), 107.706, 117.849, 97.591, 107.645],
    [dt.date(2020, 4, 2), dt.time(1), 107.058, 117.217, 97.008, 107.093],
    [dt.date(2020, 4, 2), dt.time(2), 107.092, 117.335, 97.088, 107.271],
    [dt.date(2020, 4, 2), dt.time(3), 107.269, 117.280, 97.109, 107.241],
    [dt.date(2020, 4, 3), dt.time(1), 107.862, 118.104, 97.819, 107.974],
    [dt.date(2020, 4, 3), dt.time(2), 107.977, 118.010, 97.866, 107.933],
    [dt.date(2020, 4, 3), dt.time(3), 107.932, 117.963, 97.837, 107.840],
    [dt.date(2020, 4, 4), dt.time(1), 108.530, 118.552, 98.368, 108.493],
    [dt.date(2020, 4, 4), dt.time(2), 108.494, 118.569, 98.420, 108.439],
    [dt.date(2020, 4, 4), dt.time(3), 108.437, 118.466, 98.195, 108.283]
]
"""

ohlc_data = [
    [2010, 1, 10, 107.556, 117.921, 97.546, 107.789],
    [2010, 1, 11, 107.788, 117.944, 97.672, 107.708],
    [2010, 2, 10, 107.706, 117.849, 97.591, 107.645],
    [2010, 2, 11, 107.058, 117.217, 97.008, 107.093],
    [2011, 1, 10, 107.092, 117.335, 97.088, 107.271],
    [2011, 1, 11, 107.269, 117.280, 97.109, 107.241],
    [2011, 2, 10, 107.862, 118.104, 97.819, 107.974],
    [2011, 2, 11, 107.977, 118.010, 97.866, 107.933],
    [2012, 1, 10, 107.932, 117.963, 97.837, 107.840],
    [2012, 1, 11, 108.530, 118.552, 98.368, 108.493],
    [2012, 2, 10, 108.494, 118.569, 98.420, 108.439],
    [2012, 2, 11, 108.437, 118.466, 98.195, 108.283],
]

print("\n{:*<100}".format("***** DataFrameの生成 "))
df = pd.DataFrame(
    ohlc_data, columns=["year", "month", "day", "open", "high", "low", "close"]
)
print(df)
print("\n{:*<100}".format("***** マルチインデックスの設定（指定） "))
df.set_index(["year", "month", "day"], inplace=True)
print(df)
print("{:-<50}".format("----- インデックスを確認 "))
print(df.index.to_list())


df_mst = df.copy()


print("\n{:*<100}".format("***** マルチインデックスの解除 "))
print("{:-<50}".format("----- 全解除 "))
df = df_mst.copy()
df_r = df.reset_index()
print(df_r)
print("{:-<50}".format("----- インデックスを確認 "))
print(df_r.index.to_list())

print("{:-<50}".format("----- 指定解除（単一） "))
df = df_mst.copy()
df_r = df.reset_index(level="month")
print(df_r)

print("{:-<50}".format("----- 指定解除（タプル） "))
df = df_mst.copy()
df_r = df.reset_index(level=("month", "day"))
print(df_r)

print("\n{:*<100}".format("***** 指定データの取得(loc) "))

print("{:-<50}".format("----- 行の取得loc(year) "))
df_r = df.loc[2011]
print(df_r)

print("{:-<50}".format("----- 行の取得loc(year, month) "))
df_r = df.loc[(2011, 2)]
print(df_r)

print("{:-<50}".format("----- 行の取得loc(year, month, day) "))
df_r = df.loc[(2011, 2, 10)]
print(df_r)

print("{:-<50}".format("----- 要素の取得 "))
elem = df.loc[(2011, 2, 10), "high"]
print(elem)

print("\n{:*<100}".format("***** 指定データの取得(xs) "))

print("{:-<50}".format("----- 行の取得loc(month) "))
df_r = df.xs(2, level="month")
print(df_r)

print("{:-<50}".format("----- 行の取得xs(year, :, day) "))
df_r = df.xs((2011, 10), level=("year", "day"))
print(df_r)


print("\n{:*<100}".format("***** 指定データの変更 "))
df = df_mst.copy()
df.loc[(2010, 2, 10), "high"] = 555.555
print(df)

df.loc[(2011, 1, 11), :] = [999.999, 999.999, 999.999, 999.999]
print(df)

print("\n{:*<100}".format("***** マルチインデックスの並び替え（ソート） "))

ohlc_data = [
    [2010, 5, 15, 107.058, 117.217, 97.008, 107.093],
    [2011, 2, 13, 107.977, 118.010, 97.866, 107.933],
    [2012, 4, 11, 108.437, 118.466, 98.195, 108.283],
    [2010, 1, 18, 107.706, 117.849, 97.591, 107.645],
    [2011, 6, 20, 107.862, 118.104, 97.819, 107.974],
    [2012, 3, 22, 108.494, 118.569, 98.420, 108.439],
    [2010, 5, 12, 107.788, 117.944, 97.672, 107.708],
    [2011, 2, 16, 107.269, 117.280, 97.109, 107.241],
    [2012, 4, 19, 108.530, 118.552, 98.368, 108.493],
    [2010, 1, 21, 107.556, 117.921, 97.546, 107.789],
    [2011, 6, 14, 107.092, 117.335, 97.088, 107.271],
    [2012, 3, 17, 107.932, 117.963, 97.837, 107.840],
]

df = pd.DataFrame(
    ohlc_data, columns=["year", "month", "day", "open", "high", "low", "close"]
)
df.set_index(["year", "month", "day"], inplace=True)
print(df)
print("{:-<50}".format("----- 並び替え（ソート） "))
df_s = df.sort_index()
print(df_s)

print("{:-<50}".format("----- 並び替え（ソート：level指定） "))
df_s = df.sort_index(level="day")
print(df_s)

print("{:-<50}".format("----- 並び替え（ソート：level指定（タプル）） "))
df_s = df.sort_index(level=("month", "day"))
print(df_s)
